; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 - counter
	)
  (:init
		(= (value c0) 3)
	(= (value c1) 29)
	(= (value c2) 12)
	(= (value c3) 1)
	(= (value c4) 51)
	(= (value c5) 55)
	(= (value c6) 27)
	(= (value c7) 59)
	(= (value c8) 87)
	(= (value c9) 64)
	(= (value c10) 28)
	(= (value c11) 12)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
		)
	)
)

; plan
1. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 5 of 11
2. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 5 of 11
3. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 5 of 11
4. (decrement_rate c10)
   changed: (rate_value c10) from 1 to 0
   goals met: 5 of 11
5. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 5 of 11
6. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 5 of 11
7. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 5 of 11
8. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 5 of 11
9. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 5 of 11
10. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 5 of 11
11. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 5 of 11
12. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 5 of 11
13. (increment c11)
   changed: (value c11) from 12 to 15
   goals met: 5 of 11
14. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 5 of 11
15. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 5 of 11
16. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 5 of 11
17. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 5 of 11
18. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 11
19. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 11
20. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 11
21. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 11
22. (increment c11)
   changed: (value c11) from 15 to 18
   goals met: 5 of 11
23. (increment c11)
   changed: (value c11) from 18 to 21
   goals met: 5 of 11
24. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 5 of 11
25. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 5 of 11
26. (increment c9)
   changed: (value c9) from 64 to 70
   goals met: 5 of 11
27. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 5 of 11
28. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 5 of 11
29. (decrement c10)
   changed: (value c10) from 28 to 20
   goals met: 6 of 11
30. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 6 of 11
31. (increment c10)
   changed: (value c10) from 20 to 28
   goals met: 5 of 11
32. (increment c9)
   changed: (value c9) from 70 to 78
   goals met: 5 of 11
33. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 5 of 11
34. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 5 of 11
35. (decrement c10)
   changed: (value c10) from 28 to 19
   goals met: 6 of 11
36. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 6 of 11
37. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 6 of 11
38. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 6 of 11
39. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 6 of 11
40. (increment c3)
   changed: (value c3) from 1 to 7
   goals met: 6 of 11
41. (increment c3)
   changed: (value c3) from 7 to 13
   goals met: 7 of 11
42. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 11
43. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 11
44. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 11
45. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 7 of 11
46. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 11
47. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 11
48. (increment c2)
   changed: (value c2) from 12 to 16
   goals met: 6 of 11
49. (increment c3)
   changed: (value c3) from 13 to 19
   goals met: 7 of 11
50. (increment c2)
   changed: (value c2) from 16 to 20
   goals met: 6 of 11
51. (increment c2)
   changed: (value c2) from 20 to 24
   goals met: 6 of 11
52. (increment c3)
   changed: (value c3) from 19 to 25
   goals met: 7 of 11
53. (increment c2)
   changed: (value c2) from 24 to 28
   goals met: 6 of 11
54. (increment c3)
   changed: (value c3) from 25 to 31
   goals met: 7 of 11
55. (decrement c1)
   changed: (value c1) from 29 to 27
   goals met: 8 of 11
56. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 8 of 11
57. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 8 of 11
58. (increment c10)
   changed: (value c10) from 19 to 29
   goals met: 7 of 11
59. (increment c10)
   changed: (value c10) from 29 to 39
   goals met: 7 of 11
60. (increment c11)
   changed: (value c11) from 21 to 24
   goals met: 7 of 11
61. (increment c11)
   changed: (value c11) from 24 to 27
   goals met: 7 of 11
62. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 11
63. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 11
64. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 11
65. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 11
66. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 7 of 11
67. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 7 of 11
68. (increment c6)
   changed: (value c6) from 27 to 33
   goals met: 7 of 11
69. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 7 of 11
70. (increment c6)
   changed: (value c6) from 33 to 40
   goals met: 7 of 11
71. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 7 of 11
72. (increment c6)
   changed: (value c6) from 40 to 48
   goals met: 7 of 11
73. (increment c6)
   changed: (value c6) from 48 to 56
   goals met: 8 of 11
74. (increment c11)
   changed: (value c11) from 27 to 30
   goals met: 8 of 11
75. (increment c11)
   changed: (value c11) from 30 to 33
   goals met: 8 of 11
76. (increment c11)
   changed: (value c11) from 33 to 36
   goals met: 8 of 11
77. (increment c11)
   changed: (value c11) from 36 to 39
   goals met: 8 of 11
78. (increment c11)
   changed: (value c11) from 39 to 42
   goals met: 9 of 11
79. (increment c10)
   changed: (value c10) from 39 to 49
   goals met: 8 of 11
80. (increment c11)
   changed: (value c11) from 42 to 45
   goals met: 8 of 11
81. (increment c11)
   changed: (value c11) from 45 to 48
   goals met: 8 of 11
82. (increment c11)
   changed: (value c11) from 48 to 51
   goals met: 9 of 11
83. (increment c9)
   changed: (value c9) from 78 to 88
   goals met: 10 of 11
84. (increment c10)
   changed: (value c10) from 49 to 59
   goals met: 9 of 11
85. (increment c11)
   changed: (value c11) from 51 to 54
   goals met: 9 of 11
86. (increment c10)
   changed: (value c10) from 59 to 69
   goals met: 9 of 11
87. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 9 of 11
88. (increment c11)
   changed: (value c11) from 54 to 58
   goals met: 9 of 11
89. (increment c11)
   changed: (value c11) from 58 to 62
   goals met: 9 of 11
90. (increment c11)
   changed: (value c11) from 62 to 66
   goals met: 9 of 11
91. (increment c11)
   changed: (value c11) from 66 to 70
   goals met: 10 of 11
92. (increment c10)
   changed: (value c10) from 69 to 79
   goals met: 9 of 11
93. (increment c11)
   changed: (value c11) from 70 to 74
   goals met: 9 of 11
94. (increment c11)
   changed: (value c11) from 74 to 78
   goals met: 9 of 11
95. (increment c11)
   changed: (value c11) from 78 to 82
   goals met: 10 of 11
96. (increment c10)
   changed: (value c10) from 79 to 89
   goals met: 10 of 11
97. (increment c11)
   changed: (value c11) from 82 to 86
   goals met: 10 of 11
98. (increment c11)
   changed: (value c11) from 86 to 90
   goals met: 11 of 11
